Project/Toir/src/Catalogs/торо_УсловияГарантии/торо_УсловияГарантии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_УсловияГарантии</name>
  <attributes>
    <name>ПроверятьНаработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНаработки</name>
    <type>
      <types>CatalogRef.ПараметрыВыработкиОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеНаработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПериодГарантии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаГарантии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияГарантии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_УсловияГарантии/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПроверятьНаработку Тогда
		ПроверяемыеРеквизиты.Добавить("ПоказательНаработки");
		ПроверяемыеРеквизиты.Добавить("ЗначениеНаработки");
	КонецЕсли;
	
	Если ПроверятьПериодГарантии Тогда
		ПроверяемыеРеквизиты.Добавить("ДатаНачалаГарантии");
		ПроверяемыеРеквизиты.Добавить("ДатаОкончанияГарантии");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаНачалаГарантии) И ЗначениеЗаполнено(ДатаОкончанияГарантии) Тогда
		Если ДатаНачалаГарантии >= ДатаОкончанияГарантии Тогда
			ТекстСообщения = НСтр("es='¡La fecha ha comenzado deben ser menos de fechas de la terminación!';ru='Дата начала должна быть меньше даты окончания!';en='Start date must be less than end date!'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ДатаОкончанияГарантии","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ПроверятьНаработку Тогда
		ПоказательНаработки = Неопределено;
		ЗначениеНаработки = 0;
	КонецЕсли;
	
	Если НЕ ПроверятьПериодГарантии Тогда
		ДатаНачалаГарантии = Неопределено;
		ДатаОкончанияГарантии = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
